Repository: gullinbursti/as3gullinburstilibs
Catalog: branches/fb4_burrito/as3gullinburstilibs/raw/wxChecksums-1.2.0/src/*/cksums.po
Languages: fr

source: byte
fr: octet

source: kilobyte
fr: kilooctet

source: megabyte
fr: megaoctet

source: gigabyte
fr: gigaoctet

source: terabyte
fr: teraoctet

source: petabyte
fr: petaoctet

source: exabyte
fr: exaoctet

source: zettabyte
fr: zettaoctet

source: yottabyte
fr: yottaoctet

source: B
fr: o

source: KB
fr: Ko

source: MB
fr: Mo

source: GB
fr: Go

source: TB
fr: To

source: PB
fr: Po

source: EB
fr: Eo

source: ZB
fr: Zo

source: YB
fr: Yo

source: show version information
fr: afficher le nom et la version du logiciel

source: verify sums against given list
fr: vérifier les sommes par rapport à la liste

source: append files to a checksums' file
fr: ajoute des fichiers à un fichier de sommes

source: create a checksums' file
fr: créer un fichier de sommes de contrôle

source: type of the checksums' file to create
fr: type du fichier de sommes à créer

source: list(s) of files
fr: Liste(s) de fichiers

source: delete temporary lists of files
fr: efface les listes temporaires de fichiers

source: file(s)
fr: fichier(s)

source: About %s
fr: A propos de %s

source: About
fr: A propos

source: Computes and verifies checksums
fr: Calcule et vérifie les sommes de contrôle

source: Author
fr: Auteur

source: Programmer & documentation
fr: Programmeur & documentation

source: Translations
fr: Traductions

source: Licence agreement
fr: Accord de licence

source: This program is distributed under the terms of the GPL v2.
fr: Ce programme est distribué selon les termes de la GPL v2.

source: Misc information
fr: Informations diverses

source: Built with wxWidgets %d.%d.%d.
fr: Construit avec wxWidgets %d.%d.%d.

source: Large files support enabled.
fr: Support des grands fichiers activé.

source: Large files support disabled.
fr: Support des grands fichiers désactivé.

source: &Close
fr: &Fermer

source: Settings
fr: Paramètres

source: Display
fr: Affichage

source: Behavior
fr: Comportement

source: Language
fr: Langage

source: Command line
fr: Ligne de commande

source: Checksums' files
fr: Fichiers de sommes

source: SFV files
fr: Fichiers SFV

source: MD5 files
fr: Fichiers MD5

source: Tools
fr: Outils

source: Multiple check
fr: Vérification multiple

source: Batch creation
fr: Création par lots

source: Window:
fr: Fenêtre :

source: Save and restore the &position of the window
fr: Sauvegarder et restaurer la &position de la fenêtre

source: Save and restore the &size of the window
fr: &Sauvegarder et restaurer la taille de la fenêtre

source: Headers of the checksums' list:
fr: En-têtes de la liste des sommes :

source: &Up
fr: &Monter

source: &Down
fr: &Descendre

source: Checksums' list:
fr: Liste des sommes :

source: Save the &column to sort (and the order)
fr: Sauvegarder la &colonne à trier (et l'ordre du tri)

source: Save the &widths of the columns
fr: Sauvegarder la &largeur des colonnes

source: Display the directories in &absolute path
fr: Afficher les répertoires en chemin &absolu

source: Show checksums values in:
fr: Afficher les sommes en :

source: upp&ercase
fr: ma&juscules

source: &lowercase
fr: mi&nuscules

source: Draws light &horizontal rules between rows
fr: Dessiner des bordures &horizontales entre les lignes

source: Draws light &vertical rules between columns
fr: Dessiner des bordures &verticales entre les colonnes

source: &Checks automatically the checksums file when opening it
fr: &Vérifier automatiquement les fichiers de sommes de contrôle à leur ouverture

source: &Opens a dialog box to sum up the check
fr: &Ouvrir une boîte de dialogue qui résume la vérification

source: &Displays a warning if the state of all the files is not 'OK' when saving a checksums file
fr: &Afficher un avertissement si l'état de tous les fichiers n'est pas 'OK' lors de la sauvegarde du fichier de sommes

source: Select the &language that %s should use:
fr: Sélectionnez la &langue que %s doit utiliser :

source: Language of the system (if available)
fr: Langue du système (si disponible)

source: Note: Changes you made for the language won't take effect before the next restart.
fr: Note : Les changements que vous effectuez sur le langage prendront effet au prochain démarrage.

source: When verifying a checksums' file:
fr: Lors de la vérification d'un fichier de sommes :

source: &Don't show the GUI if all the checksums are correct
fr: Ne pas afficher l'interface graphique si toutes les sommes sont &correctes

source: When adding files to a checksums' file:
fr: Lors de l'ajout de fichiers au fichier de sommes :

source: &Never show the GUI
fr: &Ne jamais afficher l'interface graphique

source: Show the GUI on &errors
fr: Afficher l'interface graphique en cas d'&erreur

source: Show the GUI on errors or &warnings
fr: Afficher l'interface graphique en cas d'erreur ou d'&avertissement

source: &Always show the GUI
fr: &Toujours afficher l'interface graphique

source: When creating a checksums' file:
fr: Lors de la création d'un fichier de sommes :

source: Ne&ver show the GUI
fr: Ne &jamais afficher l'interface graphique

source: Show the GUI on e&rrors
fr: Afficher l'interface graphique en cas d'e&rreur

source: Show the GUI on errors or warnin&gs
fr: Afficher l'interface graphique en cas d'erreur ou d'a&vertissement

source: Alwa&ys show the GUI
fr: T&oujours afficher l'interface graphique

source: Note: Error and warning messages are always displayed.
fr: Note : Les messages d'erreur et d'avertissement sont toujours affichés.

source: Path separator on reading SFV files:
fr: Séparateur de chemin pour la lecture des fichiers SFV :

source: &Automatic recognition
fr: Reconnaissance &automatique

source: Saving SFV files:
fr: Sauvegarde des fichiers SFV :

source: Save the &name of the generator and the date of creation in the comments
fr: Sauvegarder le &nom du générateur et la date de création dans les commentaires

source: Identi&fy as:
fr: Identi&fier comme :

source: Save the size and the modification &date of the files in the comments
fr: Sauvegarder la taille et la &date de modification des fichiers dans les commentaires

source: Use the following path sepator:
fr: Utiliser le séparateur de chemin suivant :

source: S&ystem default: '%c'
fr: Celui du s&ystème : '%c'

source: Use the following end of line:
fr: Utiliser la fin de ligne suivante :

source: Syst&em native
fr: Celle du systèm&e

source: Path separator on reading MD5 files:
fr: Séparateur de chemin pour la lecture des fichiers SFV :

source: Saving MD5 files:
fr: Sauvegarde des fichiers MD5 :

source: Displaying of the results:
fr: Affichage des résultats :

source: Display a &global summary
fr: Afficher un récapitulatif &global

source: Display a summary for each &checksums' file
fr: Afficher un récapitulatif pour &chaque fichier de sommes

source: Display the state of each checked &file
fr: Afficher l'état de chaque &fichier vérifié

source: Don't display the state of the c&orrect files
fr: Ne pas afficher l'état des fichiers c&orrects

source: Text colours:
fr: Couleurs du texte :

source: &Success:
fr: &Succès :

source: &Warning:
fr: A&vertissement :

source: &Error:
fr: &Erreur :

source: When a checksums' file alrealdy exists:
fr: Quand un fichier de sommes existe :

source: S&kip the creation
fr: &Passer la création

source: &Overwrite it
fr: &L'écraser

source: Create the name of the checksums' file by:
fr: Créer le nom du fichier de sommes en :

source: &Replacing the extension of the source file with the extension of the type of the checksums' file
fr: &Remplaçant l'extension du fichier source avec l'extension du type du fichier de sommes

source: &Adding the extension of the type of the checksums' file to the name of the source file
fr: A&joutant l'extension du type du fichier de sommes au nom du fichier source

source: Level of &verbosity of the report:
fr: N&iveau de verbosité du rapport :

source: Errors only
fr: Erreurs seulement

source: Errors and warnings
fr: Erreurs et avertissements

source: Talkative
fr: Bavard

source: Cancel
fr: Annuler

source: Personalized...
fr: Personnalisé...

source: Name of the generator:
fr: Nom du programme générateur :

source: Identify as
fr: Identifier comme

source: File name
fr: Nom du fichier

source: Reason
fr: Raison

source: Please wait...
fr: Veuillez patienter...

source: Please give a name for the new checksum file.
fr: Veuillez fournir un nom pour le nouveau fichier de sommes.

source: Please give an absolute path for the name of the new checksum file.
fr: Veuillez fournir un chemin absolu pour le nom du nouveau fichier de sommes de contrôle.

source: The directory '%s' doesn't exist.
fr: Le répertoire '%s' n'existe pas.

source: '%s' is a directory.
fr: '%s' est un répertoire.

source: The file '%s' already exists. Do you want to overwrite it?
fr: Le fichier '%s' existe déjà. Souhaitez-vous l'écraser ?

source: Create a new file
fr: Créer un nouveau fichier

source: You don't have sufficient rights to write on '%s'.
fr: Vous n'avez pas les droits suffisants pour écrire sur '%s'.

source: Invalid file name
fr: Nom de fichier invalide

source: Create a new checksums file
fr: Créer un nouveau fichier de sommes

source: Type of the new file:
fr: Type du nouveau fichier :

source: &SFV file
fr: Fichier &SFV

source: &MD5 file
fr: Fichier &MD5

source: &Name of the new file:
fr: &Nom du nouveau fichier :

source: &Browse...
fr: &Parcourir...

source: &Cancel
fr: &Annuler

source: new
fr: nouveau

source: Choose a name for the new checksums file
fr: Choisissez un nom pour le nouveau fichier de sommes

source: Known checksums files
fr: Fichiers de sommes reconnus

source: All the files
fr: Tous les fichiers

source: &File
fr: &Fichier

source: &New... Ctrl+N
fr: &Nouveau... Ctrl+N

source: Creates a new checksum file.
fr: Crée un nouveau fichier de sommes.

source: &Open... Ctrl+O
fr: &Ouvrir... Ctrl+O

source: Opens a checksum file.
fr: Ouvre un fichier de sommes.

source: Open &recent
fr: &Récemment ouvert(s)

source: &Save Ctrl+S
fr: &Enregistrer Ctrl+S

source: Saves the checksum file.
fr: Enregistre le fichier de sommes.

source: Save &as...
fr: Enregistrer &sous...

source: Saves the checksum file in another file.
fr: Enregistre les sommes dans un autre fichier.

source: &Close Ctrl+W
fr: &Fermer Ctrl+W

source: Closes the checksum file.
fr: Ferme le fichier de sommes.

source: &Quit Ctrl+Q
fr: &Quitter Ctrl+Q

source: Quit %s.
fr: Quitte %s.

source: &Sums
fr: &Sommes

source: Add &files... Insert
fr: Ajouter des &fichiers... Insert

source: Add files to the checksum file.
fr: Ajoute des fichiers au fichier de sommes.

source: Add &directories... Ctrl+D
fr: Ajouter des &répertoires... Ctrl+D

source: Add directories to the checksum file.
fr: Ajoute des répertoires au fichier de sommes.

source: Add &matching files... Shift+Insert
fr: Ajouter des fichiers depuis un fi&ltre... Shift+Insert

source: Select some files from a matching pattern and add them to the to the checksum file.
fr: Sélectionne des fichiers depuis un filtre et les ajoute au fichier de sommes de contrôle.

source: &Remove Delete
fr: &Supprimer Delete

source: Remove the selected checksums from the checksum file.
fr: Supprime les sommes sélectionnées du fichier de sommes.

source: &Check Ctrl+C
fr: &Vérifier Ctrl+C

source: Checks the selected files or all files if none is selected.
fr: Vérifie les fichiers sélectionnés ou tous les fichiers si aucun n'est sélectionné.

source: Re&compute Ctrl+R
fr: Re&calculer Ctrl+R

source: Recompute the checksums of the selected files.
fr: Recalcule les sommes de contrôle sélectionnées pour les fichiers sélectionnés.

source: File &name
fr: &Nom du fichier

source: Sort the checksums' list by file name.
fr: Trie la liste de sommes de contrôle par nom de fichier.

source: &Directory
fr: &Répertoire

source: Sort the checksums' list by directory.
fr: Trie la liste de sommes de contrôle par répertoire.

source: Checksum &value
fr: &Valeur de la somme

source: Sort the checksums' list by value.
fr: Trie la liste de sommes de contrôle par valeur de somme de contrôle.

source: &State
fr: &Etat

source: Sort the checksums' list by state.
fr: Trie la liste de sommes de contrôle par état.

source: &Ascending order
fr: Ordre &croissant

source: Sort the checksums' list in ascending order.
fr: Effectue le tri par ordre croissant.

source: D&escending order
fr: Ordre &décroissant

source: Sort the checksums' list in descending order.
fr: Effectue le tri par ordre décroissant.

source: D&on't sort
fr: Ne &pas trier

source: Don't sort the checksums' list.
fr: Ne pas trier la liste de sommes de contrôle.

source: &Sort by
fr: Trier &par

source: Select &all Ctrl+A
fr: Sélectionner &tout Ctrl+A

source: Selects all the files.
fr: Sélectionner tous les fichiers.

source: &Invert selection Ctrl+I
fr: &Inverser la sélection Ctrl+I

source: Selects non-selected files and deselects selected files.
fr: Sélectionne les fichiers non sélectionnés et désélectionne les fichier sélectionnés.

source: &Tools
fr: &Outils

source: Check &multiple checksums' files... Ctrl+M
fr: &Vérifier plusieurs fichiers de sommes... Ctrl+M

source: Checks several checksums' files at the same time.
fr: Vérifie plusieurs fichiers de sommes à la fois.

source: &Batch creation of checksums' files... Ctrl+B
fr: Création de fichiers de sommes par &lots... Ctrl+B

source: Creates one checksums' file for each file selected in the following dialog.
fr: Crée un fichier de sommes pour chaque fichier sélectionné dans la boîte de dialogue suivante.

source: &Configure %s...
fr: &Configurer %s...

source: Sets the parameters of %s.
fr: Modifie les paramètres de %s.

source: &Help
fr: &Aide

source: &About %s...
fr: &A propos de %s...

source: Displays information about %s.
fr: Affiche des informations sur %s.

source: New
fr: Nouveau

source: Open
fr: Ouvrir

source: Save
fr: Sauvegarder

source: Add files
fr: Ajouter des fichiers

source: Add directories
fr: Ajouter des répertoires

source: Add matching files
fr: Ajouter des fichiers depuis un filtre

source: Remove checksums
fr: Supprimer des sommes

source: Check
fr: Vérifier

source: Check files
fr: Vérifier les fichiers

source: Recompute
fr: Recalculer

source: Recompute checksums
fr: Recalcule les sommes de contrôle

source: Configure
fr: Configurer

source: Configure %s
fr: Configurer %s

source: Welcome
fr: Bienvenue

source: '%s' is a directory. The checksums' file will be not be saved. Do you want to continue?
fr: '%s' est un répertoire. Le fichier de sommes ne sera pas sauvegardé. Voulez-vous continuer ?

source: Error - %s
fr: Erreur - %s

source: '%s' exists but its format is unknown. Do you want to create a new checksums' file with this name and overwrite the existing file?
fr: '%s' existe mais son format est inconnu. Voulez-vous créer un nouveau fichier de sommes avec ce nom et écraser le fichier existant ?

source: Warning - %s
fr: Avertissement - %s

source: An error has occurred during the save process of the file.
fr: Une erreur s'est produite durant la sauvegarde du fichier.

source: (Modified)
fr: (Modifié)

source: Some checksums are not valid. Do you really wish to save this checksums file?
fr: Certaines sommes de contrôles ne sont pas valides. Souhaitez-vous vraiment sauvegarder ce fichier de sommes ?

source: This checksum file has been modified. Would you like to save it?
fr: Le fichier de sommes de contrôle a été modifié. Souhaitez-vous le sauvegarder ?

source: Open this checksums' file.
fr: Ouvre ce fichier de sommes.

source: Select the checksums file
fr: Sélectionnez le fichier de sommes

source: '%s' is already opened. Do you want to reopen it?
fr: '%s' est déjà ouvert. Souhaitez-vous le réouvrir ?

source: Save the checksums file as
fr: Enregistre le fichier de sommes sous

source: '%s' will be closed even if you choose to cancel. If you want to save the current checksums file, choose 'yes' now.
fr: '%s' sera fermé même si vous choisissez d'annuler. Si vous voulez sauvegarder le fichier de sommes, choisissez 'oui' maintenant.

source: Beginning...
fr: Début...

source: Finished
fr: Fin

source: Not verified
fr: Non vérifié

source: Select the files to be added
fr: Sélectionnez les fichiers à ajouter

source: Select the directory
fr: Sélectionnez le répertoire

source: Computing the checkum of %s %s on %s read.
fr: Calcule la somme de %s %s sur %s lus.

source: Computing the checksums
fr: Calcul des sommes

source: Error while reading the file
fr: Erreur lors de la lecture du fichier

source: File not found
fr: Fichier non trouvé

source: File cannot be open
fr: Le fichier n'a pas pu être ouvert

source: Invalid files
fr: Fichiers invalides

source: The following files were not added to the list of the checksums:
fr: Les fichiers suivants ne seront pas ajoutés à la liste des sommes :

source: Checking for duplicate files
fr: Recherche les fichiers en double

source: Checking %s
fr: Vérifie %s

source: Finished.
fr: Fin.

source: 1 file was checked.
fr: 1 fichier a été vérifié.

source: %d files were checked.
fr: %d fichiers ont été vérifiés.

source: All are ok.
fr: Tous sont valides.

source: All are invalid.
fr: Tous sont invalides.

source: All cannot be opened.
fr: Aucun n'a pu être ouvert.

source: None is ok
fr: Aucun n'est valide

source: 1 is ok
fr: 1 est valide

source: %d are ok
fr: %d sont valides

source: , 1 is invalid
fr: , 1 est invalide

source: , %d are invalid
fr: , %d sont invalides

source: , 1 can't be opened
fr: , 1 n'a pas pu être ouvert

source: , %d can't be opened
fr: , %d n'ont pas pu être ouverts

source: '%s' cannot be read.
fr: '%s' n'a pas pu être lu.

source: Open a checksums' file
fr: Ouvrir un fichier de sommes.

source: Checking %s %s on %s read.
fr: Vérifie %s %s sur %s lus.

source: Checking the files
fr: Vérification des fichiers en cours

source: Checksums differ
fr: Sommes différentes

source: Checking checksums
fr: Vérification des sommes de contrôle

source: Recomputing the checkum of %s %s on %s read.
fr: Recalcule la somme de %s %s sur %s lus.

source: Recomputing the checksums
fr: Recalcul des sommes

source: &Add files...
fr: Ajouter des &fichiers...

source: A&dd directories...
fr: Ajouter des &répertoires...

source: Add &matching files...
fr: Ajouter des fichiers depuis un fi&ltre...

source: &Remove
fr: &Supprimer

source: Directory
fr: Répertoire

source: Checksum value
fr: Valeur de la somme

source: State
fr: Etat

source: Searching files
fr: Recherche des fichiers

source: Unknow
fr: Inconnu

source: Check multiple checksums' files
fr: Vérifier plusieurs fichiers de sommes

source: &Check
fr: &Vérifier

source: List of files to c&heck:
fr: &Liste des fichiers à vérifier :

source: Search &for some files to check:
fr: &Rechercher des fichiers à vérifier :

source: Select the files to be checked
fr: Sélectionnez les fichiers à vérifier

source: Add a list of checksums' files
fr: Ajouter à la liste des fichiers de sommes

source: Load a list of checksums' files
fr: Charger une liste de fichier de sommes

source: Save a list of checksums' files
fr: Enregistrer la liste des fichiers de sommes

source: Checking:
fr: Vérifie :

source: In checksums' file:
fr: Dans le fichier de sommes :

source: Current file:
fr: Fichier courant :

source: '%s': Checksums differ
fr: '%s' : Sommes différentes

source: Error while reading '%s'.
fr: Erreur lors de la lecture de '%s'.

source: '%s': File not found
fr: '%s' : Fichier non trouvé

source: '%s': File cannot be opened
fr: '%s' : Le fichier n'a pas pu être ouvert

source: Checking '%s'.
fr: Vérification de '%s'.

source: Checking '%s'...
fr: Vérification de '%s'...

source: Total checked: %d
fr: Vérifié(s) au total : %d

source: Not found: %d
fr: Non trouvé(s) : %d

source: Not opened: %d
fr: Non ouvert(s) : %d

source: All checksums are corrects.
fr: Toutes les sommes de contrôle sont correctes.

source: Some checksums are incorrects.
fr: Certaines sommes de contrôle sont incorrectes.

source: '%s' is empty.
fr: '%s' est vide.

source: '%s' is not a valid checksums' file.
fr: '%s' n'est pas un fichier de sommes de contrôle valide.

source: '%s' cannot be opened.
fr: '%s' n'a pas pu être ouvert.

source: Total checksums' files checked: %d
fr: Fichier(s) de sommes de contrôle vérifié(s) au total : %d

source: Partially correct(s): %d
fr: Partiellement correct(s) : %d

source: Fully incorrect(s): %d
fr: Complètement incorrect(s) : %d

source: Invalid(s): %d
fr: Invalide(s) : %d

source: All checksums' files are corrects.
fr: Tous les fichiers de sommes de contrôle sont corrects.

source: Some checksums' files are incorrects.
fr: Certains fichiers de sommes de contrôle sont incorrects.

source: Add a matching pattern at least.
fr: Ajoutez au moins un filtre.

source: Warning
fr: Avertissement

source: List of the matc&hing patterns:
fr: Liste &des filtres :

source: Pattern
fr: Filtre

source: Depth
fr: Profondeur

source: Add li&st...
fr: A&jouter la liste...

source: L&oad list...
fr: &Charger la liste...

source: Sa&ve list...
fr: Sa&uver la liste...

source: Sort b&y:
fr: Tr&ier par :

source: Ascending
fr: Croissant

source: Descending
fr: Décroissant

source: Don't sort
fr: Ne pas trier

source: Sor&t order:
fr: Ordre du &tri :

source: Add a mathing pattern to the li&st:
fr: Aj&outer un filtre à la liste :

source: Patter&n(s):
fr: Fi&ltres(s) :

source: D&irectory:
fr: &Répertoire:

source: &Depth:
fr: Pro&fondeur :

source: Add patt&ern
fr: Ajout&er le filtre

source: &Add...
fr: &Ajouter...

source: Ca&ncel
fr: A&nnuler

source: Add matching files - %s
fr: Ajouter des fichiers depuis un filtre - %s

source: wxChecksums matching patterns files
fr: Filtres de wxChecksums

source: Add a list of matching patterns
fr: Ajouter une liste de filtres

source: Load a list of matching patterns
fr: Charger une liste de filtres

source: Save the list of matching patterns
fr: Sauvegarder une liste de filtres

source: The verify switch and the create option are incompatibles.
fr: Les options verify et create sont incompatibles.

source: The verify switch and the append option are incompatibles.
fr: Les options verify et append sont incompatibles.

source: The verify switch needs that you specify one file to check.
fr: Vous devez spécifier un fichier à vérifier avec l'option verify.

source: The verify switch needs that you specify only one file to check.
fr: Vous ne pouvez spécifier qu'un seul fichier à vérifier avec l'option verify.

source: The name of the file to check is empty.
fr: Le nom du fichier à vérifier est vide.

source: The append option and the verify switch are incompatibles.
fr: Les options append et verify sont incompatibles.

source: The append and create options are incompatibles.
fr: Les options append et create sont incompatibles.

source: The name of the checksums' file where the checksums will be added is empty.
fr: Le nom du fichier de sommes où les sommes vont être ajoutées est vide.

source: The directory %s doesn't exist.
fr: Le répertoire %s n'existe pas.

source: The create option and the verify switch are incompatibles.
fr: Les options create et verify sont incompatibles.

source: The create and append options are incompatibles.
fr: Les options create et append sont incompatibles.

source: The name of the checksums' file to create is empty.
fr: Le nom du fichier de sommes à créer est vide.

source: The type of the checksums' file to create is invalid. Valids types are 'sfv' and 'md5'.
fr: Le type du fichier de sommes à créer est invalide. Les types valides sont 'sfv' et 'md5'.

source: You can specify only one file to check at the same time.
fr: Vous ne pouvez spécifier qu'un seul fichier à ouvrir à la fois.

source: Elapsed time:
fr: Temps écoulé :

source: unknown
fr: inconnu

source: Estimated time:
fr: Temps estimé :

source: Remaining time:
fr: Temps restant :

source: Done.
fr: Fait.
