Repository: gullinbursti/as3gullinburstilibs
Catalog: branches/fb4_burrito/as3gullinburstilibs/raw/wxChecksums-1.2.0/src/*/cksums.po
Languages: fr

source: C&ontinue
fr: &Continuer

source: SFV checksums' file
fr: Fichier de sommes SFV

source: MD5 checksums' file
fr: Fichier de sommes MD5

source: Options of the batch creation of checksums' files
fr: Options de la création de fichiers de sommes par lots

source: &Replacing the extension of the source file with the extension of the type of the checksums' file.
fr: &Remplaçant l'extension du fichier source avec l'extension du type du fichier de sommes.

source: &Adding the extension of the type of the checksums' file to the name of the source file.
fr: A&joutant l'extension du type du fichier de sommes au nom du fichier source.

source: Create the following types of checks&ums' file:
fr: Créer le nom d&u fichier de sommes en :

source: Select as least a type of checksums' file.
fr: Sélectionnez au moins un type de fichiers de sommes.

source: Batch creation of checksums' files
fr: Création de fichiers de sommes par lots

source: &Create
fr: Cr&éer

source: List of files from which the c&hecksums' files will be created:
fr: &Liste des fichiers à partir desquels les fichiers de sommes seront créés :

source: Search &for some files:
fr: &Rechercher des fichiers :

source: Add a list of files
fr: Ajouter à la liste des fichiers

source: Load a list of files
fr: Charger une liste de fichiers

source: Save a list of files
fr: Enregistrer la liste des fichiers

source: Creating:
fr: Crée :

source: '%s' already exists. Skipping.
fr: '%s' existe déjà. Passe la création.

source: '%s' has been overwritten.
fr: '%s' a été écrasé.

source: '%s' has been created.
fr: '%s' a été créé.

source: (Checksum value : %s).
fr: (Valeur de la somme : %s).

source: Error while writing '%s'.
fr: Erreur lors de l'écriture de '%s'.

source: Processing '%s'.
fr: Traitement de '%s'.

source: All the checksums' files exist. Skipping.
fr: Tous les fichiers de sommes de contrôle existent. Passe ce fichier.

source: '%s': File not found.
fr: '%s' : Fichier non trouvé.

source: '%s': File cannot be opened.
fr: '%s' : Le fichier n'a pas pu être ouvert.

source: Total file(s) processed: %d
fr: Fichier(s) traité(s) au total : %d

source: (Skipped: %d)
fr: (Passé(s) : %d)

source: File(s) not found: %d
fr: Non trouvé(s) : %d

source: File(s) not opened: %d
fr: Non ouvert(s) : %d

source: Error(s) while reading: %d
fr: Erreur(s) de lecture : %d

source: Total checksums' file(s) processed: %d
fr: Fichier(s) de sommes de contrôle traité(s) au total : %d

source: Successfully processed: %d
fr: Traité(s) avec succès : %d

source: Created: %d
fr: Créé(s) : %d

source: Skipped: %d
fr: Passé(s) : %d

source: Overwritten: %d
fr: Ecrasé(s) : %d

source: Error(s) while writing: %d
fr: Erreur(s) d'écriture : %d

source: Select at least a file.
fr: Sélectionner au moins un fichier.

source: &Named:
fr: N&ommé :

source: Look &in:
fr: Regarder &dans :

source: S&earch and add
fr: R&echercher et ajouter

source: Known files
fr: Fichiers reconnus

source: Text files
fr: Fichiers texte

source: List of files
fr: Liste des fichiers

source: Please choose a directory.
fr: Veuillez choisir un répertoire.

source: '%s' is invalid.
fr: '%s' est invalide.
